{
  "effectiveDate": "2025-07-29",
  "company": {
    "name": "AIJ Solutions",
    "contactEmail": "aijsolutions.co@gmail.com"
  },
  "definitions": {
    "Service": "The Tarbiyah Learning Academy School Management System (SMS) platform.",
    "User": "Anyone accessing or using the Service, including parents, teachers, administrators, and students.",
    "Account": "A password-protected user registration on the Service.",
    "Educational Institution": "Tarbiyah Learning Academy and any affiliated educational organizations.",
    "Educational Data": "Student records, academic information, attendance data, and other educational information."
  },
  "sections": [
    {
      "title": "1. Acceptance of Terms",
      "text": "By accessing or using the Tarbiyah Learning Academy School Management System (SMS), you agree to be bound by these Terms of Service. If you do not agree to these terms, please do not use our service. These terms apply to all users of the platform, including parents, teachers, administrators, and students."
    },
    {
      "title": "2. Service Description",
      "text": "Tarbiyah Learning Academy SMS is an educational technology platform that provides school management services including student record management, academic progress tracking, parent-teacher communication, attendance management, and administrative functions. The service is designed to enhance educational operations and facilitate communication within the school community.",
      "items": [
        "Student Management: Record keeping, academic progress tracking, and attendance management",
        "Communication Tools: Secure messaging between parents, teachers, and administrators",
        "Administrative Functions: Class scheduling, grade management, and reporting",
        "Educational Support: Academic progress monitoring and educational resource access"
      ]
    },
    {
      "title": "3. Account Registration & Security",
      "text": "To access our educational services, you must create an account with accurate information:",
      "items": [
        "Provide accurate, current, and complete information during registration",
        "Maintain the security of your account credentials and notify us immediately of any unauthorized access",
        "You are responsible for all activities that occur under your account",
        "Accounts are personal and may not be shared with others",
        "Educational institutions may manage account access for their staff and students"
      ]
    },
    {
      "title": "4. Educational Use & User Conduct",
      "text": "Our service is designed for educational purposes and must be used appropriately:",
      "items": [
        "Use the service only for educational purposes and school management activities",
        "Comply with all applicable laws, educational regulations, and school policies",
        "Respect the privacy and rights of other users, especially students",
        "Do not misuse the service (no hacking, spamming, or uploading unlawful content)",
        "Maintain appropriate professional conduct in all communications",
        "Follow educational institution guidelines and policies"
      ]
    },
    {
      "title": "5. Educational Data & Privacy",
      "text": "We handle educational data with special care and in compliance with educational privacy laws:",
      "items": [
        "All student data is treated as educational records with appropriate protections",
        "We comply with Family Educational Rights and Privacy Act (FERPA) requirements",
        "Educational data is used exclusively for educational purposes",
        "Access to student records is limited to authorized personnel",
        "We maintain appropriate security measures to protect educational information"
      ]
    },
    {
      "title": "6. License Grant & Restrictions",
      "text": "We grant you a limited, non-exclusive, non-transferable license to use our educational service:",
      "items": [
        "License is limited to educational use and school management purposes",
        "You may not copy, modify, or distribute our software or content",
        "You may not reverse engineer or attempt to access our systems",
        "License terminates automatically if you violate these terms",
        "Educational institutions may have additional licensing terms"
      ]
    },
    {
      "title": "7. Intellectual Property",
      "text": "All content, software, and technology in our service are owned by AIJ Solutions or our licensors:",
      "items": [
        "All software, code, and platform technology remain our property",
        "Educational content and materials may be owned by the educational institution",
        "User-generated content remains the property of the user",
        "No intellectual property rights transfer except as expressly stated",
        "Trademarks and branding are protected under applicable laws"
      ]
    },
    {
      "title": "8. Service Availability & Support",
      "text": "We strive to provide reliable educational services:",
      "items": [
        "We maintain the service to ensure educational continuity",
        "Scheduled maintenance will be communicated in advance when possible",
        "Technical support is available for educational institutions",
        "We are not liable for temporary service interruptions",
        "Educational institutions should have backup procedures for critical functions"
      ]
    },
    {
      "title": "9. Limitation of Liability",
      "text": "Our liability is limited as follows:",
      "items": [
        "We provide the service 'as is' without warranties",
        "We are not liable for indirect, incidental, or consequential damages",
        "Our total liability is limited to the amount paid for the service",
        "Educational institutions are responsible for their use of the service",
        "We are not liable for educational outcomes or decisions made using our service"
      ]
    },
    {
      "title": "10. Termination & Account Closure",
      "text": "Accounts may be terminated under certain circumstances:",
      "items": [
        "We may suspend or terminate accounts for violations of these terms",
        "Educational institutions may manage account access for their community",
        "Upon termination, access to the service will be revoked",
        "Educational records may be retained as required by law",
        "We will provide notice of termination when possible"
      ]
    },
    {
      "title": "11. Changes to Terms",
      "text": "We may update these terms to reflect changes in our service or legal requirements:",
      "items": [
        "Changes will be posted with a new effective date",
        "Continued use after changes constitutes acceptance",
        "Educational institutions will be notified of significant changes",
        "Users should review terms periodically",
        "Material changes will be communicated via email or website notice"
      ]
    },
    {
      "title": "12. Governing Law & Disputes",
      "text": "These terms are governed by applicable law and any disputes will be resolved appropriately:",
      "items": [
        "Terms are governed by the laws of the jurisdiction where AIJ Solutions operates",
        "Disputes will be resolved through appropriate legal channels",
        "Educational disputes may be subject to educational institution policies",
        "We encourage resolution of issues through communication first",
        "Arbitration or mediation may be used for dispute resolution"
      ]
    },
    {
      "title": "13. Contact Information",
      "text": "For questions about these terms or our educational service:",
      "items": [
        "Email: aijsolutions.co@gmail.com",
        "Company: AIJ Solutions",
        "Service: Tarbiyah Learning Academy School Management System",
        "Purpose: Educational technology and school management services"
      ]
    }
  ]
}